xioabudian/hitmac-req/cpu/cc26xx-cc13xx/putchar.c
/*
 * Copyright (c) 2014, Texas Instruments Incorporated - http://www.ti.com/
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*---------------------------------------------------------------------------*/
#include "cc26xx-uart.h"
#include "ti-lib.h"
#include "contiki-conf.h"
#include <string.h>
#define SLIP_END     0300
/*---------------------------------------------------------------------------*/
int
putchar(int c)
{
  #if ROOTNODE
    static char debug_frame = 0;
    if(!debug_frame) {
      cc26xx_uart_write_byte(SLIP_END);//by huangxiaobing. in order to support tunslip6
      cc26xx_uart_write_byte('\r');
      debug_frame = 1;
    }
  #endif
  cc26xx_uart_write_byte(c);
  #if ROOTNODE
    if(c == '\n') {
      cc26xx_uart_write_byte(SLIP_END);//by huangxiaobing. in order to support tunslip6
      debug_frame = 0;
    };
  #endif
  return c;
}
/*---------------------------------------------------------------------------*/
int
puts(const char *str)
{
  int i;
  if(str == NULL) {
    return 0;
  }
  #if ROOTNODE
  cc26xx_uart_write_byte(SLIP_END);//by huangxiaobing. in order to support tunslip6
  #endif
  for(i = 0; i < strlen(str); i++) {
    cc26xx_uart_write_byte(str[i]);
  }
  cc26xx_uart_write_byte('\n');

  #if ROOTNODE
  cc26xx_uart_write_byte(SLIP_END);//by huangxiaobing. in order to support tunslip6
  #endif
  /*
   * Wait for the line to go out. This is to prevent garbage when used between
   * UART on/off cycles
   */
  while(cc26xx_uart_busy() == UART_BUSY);

  return i;
}
/*---------------------------------------------------------------------------*/
unsigned int
dbg_send_bytes(const unsigned char *s, unsigned int len)
{
  unsigned int i = 0;

  while(s && *s != 0) {
    if(i >= len) {
      break;
    }
    cc26xx_uart_write_byte(*s++);
    i++;
  }

  /*
   * Wait for the buffer to go out. This is to prevent garbage when used
   * between UART on/off cycles
   */
  while(cc26xx_uart_busy() == UART_BUSY);

  return i;
}
/*---------------------------------------------------------------------------*/
